app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" ORDER BY name
---
  def index
    @bands = Band.alphabetical.to_a

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?
---
    def set_band
      @band = Band.find(params[:id])