app/controllers/genres_controller.rb

  def index
    @genres = Genre.alphabetical.to_a
---
SELECT "genres".* FROM "genres" ORDER BY name